autoklinika/workshop-ventilation-controller/firmware/sensor-node/sdkconfig.defaults
# Target: KAmod ESP32 POW RS485 (ESP32-WROOM-32D, 4 MB flash)
CONFIG_IDF_TARGET="esp32"

# Flash and partition layout
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# OTA A/B foundation and automatic rollback of an unconfirmed image
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# USB-C serial console through the on-board CH340.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Diagnostics and crash handling
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_CHECK_BOOT=y

# Runtime safety. The production main task remains on core 0. Service Wi-Fi
# and lwIP run on core 1, so reconnect or radio work cannot starve the SEN55 /
# Modbus application loop. The optional service task is deliberately not
# registered as a Task WDT client.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y
CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_1=y
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU1=y

# PSA Crypto provides HMAC-SHA256 for authenticated heartbeat frames.
CONFIG_MBEDTLS_SHA256_C=y

# Keep the embedded C++ runtime deterministic and small
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
